<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 115.0.1901.188--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">로더 재정의 설정</string><string id="BrowserExecutableFolder">브라우저 실행 파일 폴더의 위치 구성</string><string id="BrowserExecutableFolder_Explain">이 정책은 지정된 경로에서 WebView2 런타임을 사용하도록 WebView2 응용 프로그램을 구성합니다. 폴더에는 msedgewebview2.exe, msedge.dll 등의 파일이 포함되어 있어야 합니다.

폴더 경로의 값을 설정하려면 값 이름과 값 쌍을 제공합니다. 값 이름을 응용 프로그램 사용자 모델 ID나 실행 파일 이름으로 설정합니다. &quot;*&quot; 와일드카드를 값 이름으로 사용하여 모든 응용 프로그램에 적용할 수 있습니다.

예제 값:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">브라우저 실행 파일 폴더의 위치 구성</string><string id="ReleaseChannelPreference">릴리스 채널 검색 순서 기본 설정 설정하기</string><string id="ReleaseChannelPreference_Explain">기본 채널 검색 순서는 WebView2 런타임, 베타, Dev 및 카나리아입니다.

기본 검색 순서를 거꾸로 하려면 이 정책을 1로 설정합니다.

릴리스 채널 기본 설정의 값을 설정하려면 값 이름과 값 쌍을 제공합니다. 값 이름을 응용 프로그램 사용자 모델 ID나 실행 파일 이름으로 설정합니다. &quot;*&quot; 와일드카드를 값 이름으로 사용하여 모든 응용 프로그램에 적용할 수 있습니다.

예제 값:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">릴리스 채널 검색 순서 기본 설정 설정하기</string><string id="ExperimentationAndConfigurationServiceControl">실험 및 구성 서비스와의 통신 제어</string><string id="ExperimentationAndConfigurationServiceControl_Explain">실험 및 구성 서비스는 실험 및 구성 페이로드를 클라이언트에 배포하는 데 사용됩니다.

실험 페이로드는 Microsoft가 테스트 및 피드백을 위해 사용하도록 설정한 초기 개발 기능 목록으로 구성됩니다.

구성 페이로드는 Microsoft가 사용자 환경을 최적화하기 위해 배포하려는 권장 설정 목록으로 구성됩니다.

구성 페이로드에는 호환성을 위해 특정 도메인에서 수행할 작업 목록이 포함될 수도 있습니다. 예를 들어, 브라우저는 웹 사이트가 손상된 경우 웹사이트의 사용자 에이전트 문자열을 재정의할 수 있습니다. 이러한 각 작업은 Microsoft가 사이트 소유자와 함께 문제를 해결하려고 시도하는 동안 일시적인 것으로 의도됩니다.

이 정책을 'FullMode'로 설정하면 실험 및 구성 서비스에서 전체 페이로드가 다운로드됩니다. 여기에는 실험 및 구성 페이로드가 모두 포함됩니다.

이 정책을 'ConfigurationsOnlyMode'로 설정하면 구성 페이로드만 다운로드됩니다.

이 정책을 'RestrictedMode'로 설정하면 실험 및 구성 서비스와의 통신이 완전히 중지됩니다. Microsoft는 이 설정을 권장하지 않습니다.

관리되는 장치에서 이 정책을 구성하지 않으면 베타 및 공개 버전 채널의 동작이 'ConfigurationsOnlyMode'와 동일합니다. Canary 및 개발 채널에서 동작은 'FullMode'와 동일합니다.

관리되지 않는 장치에서 이 정책을 구성하지 않으면 동작이 'FullMode'와 동일합니다.

정책 옵션 매핑:

* FullMode (2) = 구성 및 실험 검색

* ConfigurationsOnlyMode (1) = 구성만 검색

* RestrictedMode (0) = 실험 및 구성 서비스와의 통신을 사용하지 않도록 설정

이 정책을 구성할 때 이전 정보를 사용합니다.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">구성 및 실험 검색</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">구성만 검색</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">실험 및 구성 서비스와의 통신을 사용하지 않도록 설정</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge 버전 97, Windows 7 이상</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge 버전 87, Windows 7 이상</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - 기본 설정(사용자가 재정의할 수 없음)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">응용 프로그램 사용자 모델 ID 또는 실행 파일 이름으로 값 이름을 설정하십시오. 모든 응용 프로그램에 적용하려면 &quot;*&quot; 와일드카드를 값 이름으로 사용할 수 있습니다.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">응용 프로그램 사용자 모델 ID 또는 실행 파일 이름으로 값 이름을 설정하십시오. 모든 응용 프로그램에 적용하려면 &quot;*&quot; 와일드카드를 값 이름으로 사용할 수 있습니다.</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">실험 및 구성 서비스와의 통신 제어</dropdownList></presentation></presentationTable></resources></policyDefinitionResources>